{
  "i18n": true,
  "type": "panel",
  "items": {
    "_header": {
      "type": "header",
      "text": "BMW CarData Configuration",
      "size": 3
    },
    "_info": {
      "type": "staticText",
      "text": {
        "en": "This adapter uses the new BMW CarData API with OAuth2 authentication and real-time MQTT streaming.",
        "de": "Dieser Adapter verwendet die neue BMW CarData API mit OAuth2-Authentifizierung und Echtzeit-MQTT-Streaming.",
        "ru": "Этот адаптер использует новый BMW CarData API с OAuth2 аутентификацией и MQTT потоком в реальном времени.",
        "pt": "Este adaptador usa a nova API BMW CarData com autenticação OAuth2 e streaming MQTT em tempo real.",
        "nl": "Deze adapter gebruikt de nieuwe BMW CarData API met OAuth2 authenticatie en realtime MQTT streaming.",
        "fr": "Cet adaptateur utilise la nouvelle API BMW CarData avec authentification OAuth2 et streaming MQTT en temps réel.",
        "it": "Questo adattatore utilizza la nuova API BMW CarData con autenticazione OAuth2 e streaming MQTT in tempo reale.",
        "es": "Este adaptador utiliza la nueva API BMW CarData con autenticación OAuth2 y streaming MQTT en tiempo real.",
        "pl": "Ten adapter używa nowego BMW CarData API z uwierzytelnianiem OAuth2 i strumieniem MQTT w czasie rzeczywistym.",
        "zh-cn": "此适配器使用新的BMW CarData API，具有OAuth2身份验证和实时MQTT流。"
      },
      "newLine": true,
      "xs": 12,
      "sm": 12,
      "md": 6,
      "lg": 6,
      "xl": 6
    },
    "_setup": {
      "type": "staticText",
      "text": {
        "en": "Setup Instructions: 1. Visit BMW ConnectedDrive portal (https://www.bmw.de/de-de/mybmw/vehicle-overview/) 2. Go to CarData section 3. Generate a client ID 4. Subscribe to API and streaming services 5. Configure data descriptors",
        "de": "Setup-Anweisungen: 1. BMW ConnectedDrive Portal besuchen (https://www.bmw.de/de-de/mybmw/vehicle-overview/) 2. CarData Bereich aufrufen 3. Client ID generieren 4. API und Streaming Services abonnieren 5. Datendeskriptoren konfigurieren",
        "ru": "Инструкции по настройке: 1. Посетите портал BMW ConnectedDrive (https://www.bmw.de/de-de/mybmw/vehicle-overview/) 2. Перейдите в раздел CarData 3. Создайте client ID 4. Подпишитесь на API и streaming сервисы 5. Настройте дескрипторы данных",
        "pt": "Instruções de configuração: 1. Visite o portal BMW ConnectedDrive (https://www.bmw.de/de-de/mybmw/vehicle-overview/) 2. Vá para a seção CarData 3. Gere um client ID 4. Inscreva-se nos serviços de API e streaming 5. Configure descritores de dados",
        "nl": "Setup instructies: 1. Bezoek BMW ConnectedDrive portal (https://www.bmw.de/de-de/mybmw/vehicle-overview/) 2. Ga naar CarData sectie 3. Genereer een client ID 4. Abonneer op API en streaming services 5. Configureer data descriptors",
        "fr": "Instructions de configuration: 1. Visitez le portail BMW ConnectedDrive (https://www.bmw.de/de-de/mybmw/vehicle-overview/) 2. Allez dans la section CarData 3. Générez un client ID 4. Abonnez-vous aux services API et streaming 5. Configurez les descripteurs de données",
        "it": "Istruzioni di configurazione: 1. Visita il portale BMW ConnectedDrive (https://www.bmw.de/de-de/mybmw/vehicle-overview/) 2. Vai alla sezione CarData 3. Genera un client ID 4. Iscriviti ai servizi API e streaming 5. Configura i descrittori dati",
        "es": "Instrucciones de configuración: 1. Visita el portal BMW ConnectedDrive (https://www.bmw.de/de-de/mybmw/vehicle-overview/) 2. Ve a la sección CarData 3. Genera un client ID 4. Suscríbete a los servicios API y streaming 5. Configura descriptores de datos",
        "pl": "Instrukcje konfiguracji: 1. Odwiedź portal BMW ConnectedDrive (https://www.bmw.de/de-de/mybmw/vehicle-overview/) 2. Przejdź do sekcji CarData 3. Wygeneruj client ID 4. Subskrybuj usługi API i streaming 5. Skonfiguruj deskryptory danych",
        "zh-cn": "设置说明：1. 访问BMW ConnectedDrive门户 (https://www.bmw.de/de-de/mybmw/vehicle-overview/) 2. 转到CarData部分 3. 生成客户端ID 4. 订阅API和流媒体服务 5. 配置数据描述符"
      },
      "style": {
        "fontSize": "smaller",
        "fontStyle": "italic"
      },
      "newLine": true,
      "xs": 12,
      "sm": 12,
      "md": 6,
      "lg": 6,
      "xl": 6
    },
    "_cardata_setup": {
      "type": "staticText",
      "text": {
        "en": "⚠️ IMPORTANT: CarData Streaming Setup - After creating your Client ID, you MUST activate CarData Streaming and manually select ALL 244 data points in the BMW portal. Go to CarData > Data Descriptors > Select all categories and individual data points. Without this step, real-time MQTT streaming will not work!",
        "de": "⚠️ WICHTIG: CarData Streaming Setup - Nach dem Erstellen Ihrer Client ID MÜSSEN Sie CarData Streaming aktivieren und manuell ALLE 244 Datenpunkte im BMW Portal auswählen. Gehen Sie zu CarData > Datendeskriptoren > Wählen Sie alle Kategorien und einzelne Datenpunkte aus. Ohne diesen Schritt funktioniert das Echtzeit-MQTT-Streaming nicht!",
        "ru": "⚠️ ВАЖНО: Настройка CarData Streaming - После создания Client ID вы ДОЛЖНЫ активировать CarData Streaming и вручную выбрать ВСЕ 244 точки данных на портале BMW. Перейдите в CarData > Дескрипторы данных > Выберите все категории и отдельные точки данных. Без этого шага потоковая передача MQTT в реальном времени не будет работать!",
        "pt": "⚠️ IMPORTANTE: Configuração CarData Streaming - Após criar seu Client ID, você DEVE ativar o CarData Streaming e selecionar manualmente TODOS os 244 pontos de dados no portal BMW. Vá para CarData > Descritores de Dados > Selecione todas as categorias e pontos de dados individuais. Sem este passo, o streaming MQTT em tempo real não funcionará!",
        "nl": "⚠️ BELANGRIJK: CarData Streaming Setup - Na het aanmaken van uw Client ID MOET u CarData Streaming activeren en handmatig ALLE 244 datapunten selecteren in het BMW portaal. Ga naar CarData > Data Descriptors > Selecteer alle categorieën en individuele datapunten. Zonder deze stap werkt realtime MQTT streaming niet!",
        "fr": "⚠️ IMPORTANT: Configuration CarData Streaming - Après avoir créé votre Client ID, vous DEVEZ activer CarData Streaming et sélectionner manuellement TOUS les 244 points de données dans le portail BMW. Allez dans CarData > Descripteurs de données > Sélectionnez toutes les catégories et points de données individuels. Sans cette étape, le streaming MQTT en temps réel ne fonctionnera pas!",
        "it": "⚠️ IMPORTANTE: Configurazione CarData Streaming - Dopo aver creato il tuo Client ID, DEVI attivare CarData Streaming e selezionare manualmente TUTTI i 244 punti dati nel portale BMW. Vai su CarData > Descrittori Dati > Seleziona tutte le categorie e i singoli punti dati. Senza questo passaggio, lo streaming MQTT in tempo reale non funzionerà!",
        "es": "⚠️ IMPORTANTE: Configuración CarData Streaming - Después de crear tu Client ID, DEBES activar CarData Streaming y seleccionar manualmente TODOS los 244 puntos de datos en el portal BMW. Ve a CarData > Descriptores de Datos > Selecciona todas las categorías y puntos de datos individuales. ¡Sin este paso, el streaming MQTT en tiempo real no funcionará!",
        "pl": "⚠️ WAŻNE: Konfiguracja CarData Streaming - Po utworzeniu Client ID MUSISZ aktywować CarData Streaming i ręcznie wybrać WSZYSTKIE 244 punkty danych w portalu BMW. Przejdź do CarData > Deskryptory Danych > Wybierz wszystkie kategorie i poszczególne punkty danych. Bez tego kroku streaming MQTT w czasie rzeczywistym nie będzie działać!",
        "zh-cn": "⚠️ 重要：CarData流媒体设置 - 创建客户端ID后，您必须激活CarData流媒体并在BMW门户中手动选择所有244个数据点。转到CarData > 数据描述符 > 选择所有类别和单个数据点。没有此步骤，实时MQTT流媒体将无法工作！"
      },
      "style": {
        "fontSize": "smaller",
        "fontWeight": "bold",
        "color": "orange",
        "backgroundColor": "#fff3cd",
        "padding": "10px",
        "borderRadius": "4px"
      },
      "newLine": true,
      "xs": 12,
      "sm": 12,
      "md": 6,
      "lg": 6,
      "xl": 6
    },
    "clientId": {
      "type": "text",
      "label": {
        "en": "BMW CarData Client ID",
        "de": "BMW CarData Client ID",
        "ru": "BMW CarData Client ID",
        "pt": "BMW CarData Client ID",
        "nl": "BMW CarData Client ID",
        "fr": "BMW CarData Client ID",
        "it": "BMW CarData Client ID",
        "es": "BMW CarData Client ID",
        "pl": "BMW CarData Client ID",
        "zh-cn": "BMW CarData客户端ID"
      },
      "help": {
        "en": "Client ID from BMW ConnectedDrive portal CarData section. Required for OAuth2 authentication.",
        "de": "Client ID aus dem BMW ConnectedDrive Portal CarData Bereich. Erforderlich für OAuth2-Authentifizierung.",
        "ru": "Client ID из раздела CarData портала BMW ConnectedDrive. Требуется для OAuth2 аутентификации.",
        "pt": "Client ID da seção CarData do portal BMW ConnectedDrive. Necessário para autenticação OAuth2.",
        "nl": "Client ID uit BMW ConnectedDrive portal CarData sectie. Vereist voor OAuth2 authenticatie.",
        "fr": "Client ID de la section CarData du portail BMW ConnectedDrive. Requis pour l'authentification OAuth2.",
        "it": "Client ID dalla sezione CarData del portale BMW ConnectedDrive. Richiesto per l'autenticazione OAuth2.",
        "es": "Client ID de la sección CarData del portal BMW ConnectedDrive. Requerido para autenticación OAuth2.",
        "pl": "Client ID z sekcji CarData portalu BMW ConnectedDrive. Wymagane do uwierzytelniania OAuth2.",
        "zh-cn": "来自BMW ConnectedDrive门户CarData部分的客户端ID。OAuth2身份验证所需。"
      },
      "placeholder": "xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx",
      "newLine": true,
      "xs": 12,
      "sm": 12,
      "md": 6,
      "lg": 6,
      "xl": 6
    },
    "cardataStreamingUsername": {
      "type": "text",
      "label": {
        "en": "CarData Streaming Username *",
        "de": "CarData Streaming Benutzername *",
        "ru": "Имя пользователя CarData Streaming *",
        "pt": "Nome de usuário CarData Streaming *",
        "nl": "CarData Streaming gebruikersnaam *",
        "fr": "Nom d'utilisateur CarData Streaming *",
        "it": "Nome utente CarData Streaming *",
        "es": "Nombre de usuario CarData Streaming *",
        "pl": "Nazwa użytkownika CarData Streaming *",
        "zh-cn": "CarData流媒体用户名 *"
      },
      "help": {
        "en": "REQUIRED: Your CarData Streaming username (different from your BMW login). Find this in BMW ConnectedDrive portal under CarData > Streaming section. Without this, MQTT streaming will not work!",
        "de": "ERFORDERLICH: Ihr CarData Streaming Benutzername (unterscheidet sich von Ihrem BMW Login). Finden Sie diesen im BMW ConnectedDrive Portal unter CarData > Streaming Bereich. Ohne diesen funktioniert MQTT-Streaming nicht!",
        "ru": "ОБЯЗАТЕЛЬНО: Ваше имя пользователя CarData Streaming (отличается от вашего BMW логина). Найдите это на портале BMW ConnectedDrive в разделе CarData > Streaming. Без этого MQTT потоковая передача не будет работать!",
        "pt": "OBRIGATÓRIO: Seu nome de usuário CarData Streaming (diferente do seu login BMW). Encontre isso no portal BMW ConnectedDrive na seção CarData > Streaming. Sem isso, o streaming MQTT não funcionará!",
        "nl": "VEREIST: Uw CarData Streaming gebruikersnaam (verschilt van uw BMW login). Vind dit in BMW ConnectedDrive portaal onder CarData > Streaming sectie. Zonder dit werkt MQTT streaming niet!",
        "fr": "REQUIS: Votre nom d'utilisateur CarData Streaming (différent de votre connexion BMW). Trouvez ceci dans le portail BMW ConnectedDrive sous CarData > section Streaming. Sans cela, le streaming MQTT ne fonctionnera pas!",
        "it": "RICHIESTO: Il tuo nome utente CarData Streaming (diverso dal tuo login BMW). Trova questo nel portale BMW ConnectedDrive sotto CarData > sezione Streaming. Senza questo, lo streaming MQTT non funzionerà!",
        "es": "REQUERIDO: Tu nombre de usuario CarData Streaming (diferente de tu login BMW). Encuéntralo en el portal BMW ConnectedDrive bajo CarData > sección Streaming. ¡Sin esto, el streaming MQTT no funcionará!",
        "pl": "WYMAGANE: Twoja nazwa użytkownika CarData Streaming (inna niż twój login BMW). Znajdź to w portalu BMW ConnectedDrive w sekcji CarData > Streaming. Bez tego streaming MQTT nie będzie działać!",
        "zh-cn": "必需：您的CarData流媒体用户名（与您的BMW登录不同）。在BMW ConnectedDrive门户的CarData > 流媒体部分中找到此信息。没有此信息，MQTT流媒体将无法工作！"
      },
      "placeholder": "streaming_username_from_bmw_portal",
      "newLine": true,
      "xs": 12,
      "sm": 12,
      "md": 6,
      "lg": 6,
      "xl": 6
    },
    "brand": {
      "type": "select",
      "label": {
        "en": "Brand",
        "de": "Marke",
        "ru": "Марка",
        "pt": "Marca",
        "nl": "Merk",
        "fr": "Marque",
        "it": "Marca",
        "es": "Marca",
        "pl": "Marka",
        "zh-cn": "品牌"
      },
      "options": [
        {
          "label": "BMW",
          "value": "bmw"
        },
        {
          "label": "Mini",
          "value": "mini"
        },
        {
          "label": "Toyota Supra",
          "value": "toyota"
        }
      ],
      "newLine": true,
      "xs": 6,
      "sm": 6,
      "md": 3,
      "lg": 3,
      "xl": 3
    },
    "interval": {
      "type": "number",
      "label": {
        "en": "Update interval for static data (in minutes)",
        "de": "Aktualisierungsintervall für statische Daten (in Minuten)",
        "ru": "Интервал обновления для статических данных (в минутах)",
        "pt": "Intervalo de atualização para dados estáticos (em minutos)",
        "nl": "Update-interval voor statische gegevens (in minuten)",
        "fr": "Intervalle de mise à jour pour les données statiques (en minutes)",
        "it": "Intervallo di aggiornamento per dati statici (in minuti)",
        "es": "Intervalo de actualización para datos estáticos (en minutos)",
        "pl": "Interwał aktualizacji dla danych statycznych (w minutach)",
        "zh-cn": "更新间隔（分钟）"
      },
      "help": {
        "en": "API polling interval for not important static data.. Minimum 10 minutes due to quota limits (50 calls per 24h). MQTT provides real-time data.",
        "de": "API-Abfrageintervall für nicht relevante statische Information. Minimum 10 Minuten aufgrund Quota-Limits (50 Aufrufe pro 24h). MQTT liefert Echtzeitdaten.",
        "ru": "Интервал опроса API. Минимум 10 минут из-за лимитов квот (50 вызовов за 24ч). MQTT предоставляет данные в реальном времени.",
        "pt": "Intervalo de polling da API. Mínimo 10 minutos devido aos limites de quota (50 chamadas por 24h). MQTT fornece dados em tempo real.",
        "nl": "API polling interval. Minimum 10 minuten vanwege quota limieten (50 oproepen per 24u). MQTT levert realtime data.",
        "fr": "Intervalle de polling API. Minimum 10 minutes à cause des limites de quota (50 appels par 24h). MQTT fournit des données en temps réel.",
        "it": "Intervallo di polling API. Minimo 10 minuti a causa dei limiti di quota (50 chiamate per 24h). MQTT fornisce dati in tempo reale.",
        "es": "Intervalo de polling API. Mínimo 10 minutos debido a límites de cuota (50 llamadas por 24h). MQTT proporciona datos en tiempo real.",
        "pl": "Interwał odpytywania API. Minimum 10 minut z powodu limitów kwot (50 wywołań na 24h). MQTT dostarcza dane w czasie rzeczywistym.",
        "zh-cn": "API轮询间隔。由于配额限制（24小时50次调用），最少10分钟。MQTT提供实时数据。"
      },
      "min": 10,
      "max": 1440,
      "default": 60,
      "newLine": true,
      "xs": 6,
      "sm": 6,
      "md": 3,
      "lg": 3,
      "xl": 3
    },
    "ignorelist": {
      "type": "text",
      "label": {
        "en": "VIN Ignore List",
        "de": "VIN Ignorierliste",
        "ru": "Список игнорируемых VIN",
        "pt": "Lista de VINs ignorados",
        "nl": "VIN negeerlijst",
        "fr": "Liste VIN à ignorer",
        "it": "Lista VIN da ignorare",
        "es": "Lista de VIN a ignorar",
        "pl": "Lista ignorowanych VIN",
        "zh-cn": "VIN忽略列表"
      },
      "help": {
        "en": "Comma-separated list of VINs to ignore (e.g., VIN1,VIN2,VIN3)",
        "de": "Kommagetrennte Liste von VINs zum Ignorieren (z.B. VIN1,VIN2,VIN3)",
        "ru": "Список VIN через запятую для игнорирования (например, VIN1,VIN2,VIN3)",
        "pt": "Lista separada por vírgulas de VINs para ignorar (ex: VIN1,VIN2,VIN3)",
        "nl": "Kommagescheiden lijst van VINs om te negeren (bijv. VIN1,VIN2,VIN3)",
        "fr": "Liste séparée par virgules des VIN à ignorer (ex: VIN1,VIN2,VIN3)",
        "it": "Lista separata da virgole di VIN da ignorare (es: VIN1,VIN2,VIN3)",
        "es": "Lista separada por comas de VINs a ignorar (ej: VIN1,VIN2,VIN3)",
        "pl": "Lista VIN oddzielonych przecinkami do ignorowania (np. VIN1,VIN2,VIN3)",
        "zh-cn": "要忽略的VIN逗号分隔列表（例如：VIN1,VIN2,VIN3）"
      },
      "placeholder": "VIN1,VIN2,VIN3",
      "newLine": true,
      "xs": 12,
      "sm": 12,
      "md": 6,
      "lg": 6,
      "xl": 6
    },
    "_api_endpoints": {
      "type": "header",
      "text": {
        "en": "API Endpoints Configuration",
        "de": "API Endpunkt Konfiguration",
        "ru": "Конфигурация API Endpoints",
        "pt": "Configuração de Endpoints API",
        "nl": "API Endpoints Configuratie",
        "fr": "Configuration des Endpoints API",
        "it": "Configurazione Endpoints API",
        "es": "Configuración de Endpoints API",
        "pl": "Konfiguracja Punktów Końcowych API",
        "zh-cn": "API端点配置"
      },
      "size": 4
    },
    "_api_note": {
      "type": "staticText",
      "text": {
        "en": "Select which BMW CarData API endpoints to fetch. No important data is fetched. Each endpoint uses one API call from your 50 calls/24h quota. MQTT streaming provides real-time updates and doesn't count against quota.",
        "de": "Wählen Sie aus, welche BMW CarData API Endpunkte abgerufen werden sollen. Es werden nur statische Daten abgerufen. Jeder Endpunkt verwendet einen API-Aufruf aus Ihrem 50 Aufrufe/24h Kontingent. MQTT-Streaming bietet Echtzeit-Updates und zählt nicht gegen das Kontingent.",
        "ru": "Выберите, какие конечные точки BMW CarData API загружать. Важные данные не загружаются. Каждая конечная точка использует один API вызов из вашей квоты 50 вызовов/24ч. MQTT потоковая передача обеспечивает обновления в реальном времени и не засчитывается в квоту.",
        "pt": "Selecione quais endpoints da API BMW CarData buscar. Nenhum dado importante é buscado. Cada endpoint usa uma chamada API de sua cota de 50 chamadas/24h. O streaming MQTT fornece atualizações em tempo real e não conta contra a cota.",
        "nl": "Selecteer welke BMW CarData API endpoints op te halen. Er worden geen belangrijke gegevens opgehaald. Elke endpoint gebruikt één API oproep van uw 50 oproepen/24u quota. MQTT streaming biedt realtime updates en telt niet mee tegen quota.",
        "fr": "Sélectionnez quels endpoints de l'API BMW CarData récupérer. Aucune donnée importante n'est récupérée. Chaque endpoint utilise un appel API de votre quota de 50 appels/24h. Le streaming MQTT fournit des mises à jour en temps réel et ne compte pas contre le quota.",
        "it": "Seleziona quali endpoint dell'API BMW CarData recuperare. Ogni endpoint utilizza una chiamata API dalla tua quota di 50 chiamate/24h. Lo streaming MQTT fornisce aggiornamenti in tempo reale e non conta contro la quota.",
        "es": "Selecciona qué endpoints de la API BMW CarData obtener. Cada endpoint usa una llamada API de tu cuota de 50 llamadas/24h. El streaming MQTT proporciona actualizaciones en tiempo real y no cuenta contra la cuota.",
        "pl": "Wybierz które punkty końcowe API BMW CarData pobrać. Każdy punkt końcowy używa jednego wywołania API z twojej kwoty 50 wywołań/24h. Streaming MQTT zapewnia aktualizacje w czasie rzeczywistym i nie liczy się do kwoty.",
        "zh-cn": "选择要获取的BMW CarData API端点。每个端点使用您50次调用/24小时配额中的一次API调用。MQTT流提供实时更新，不计入配额。"
      },
      "style": {
        "fontSize": "smaller",
        "fontStyle": "italic",
        "color": "#666"
      },
      "newLine": true
    },

    "fetchBasicData": {
      "type": "checkbox",
      "label": {
        "en": "Fetch Basic Data",
        "de": "Grunddaten abrufen",
        "ru": "Получать базовые данные",
        "pt": "Buscar dados básicos",
        "nl": "Basisgegevens ophalen",
        "fr": "Récupérer les données de base",
        "it": "Recupera dati di base",
        "es": "Obtener datos básicos",
        "pl": "Pobierz dane podstawowe",
        "zh-cn": "获取基本数据"
      },
      "help": {
        "en": "Vehicle information, model, brand, series, VIN details",
        "de": "Fahrzeuginformationen, Modell, Marke, Serie, VIN-Details",
        "ru": "Информация о транспортном средстве, модель, бренд, серия, детали VIN",
        "pt": "Informações do veículo, modelo, marca, série, detalhes VIN",
        "nl": "Voertuiginformatie, model, merk, serie, VIN details",
        "fr": "Informations sur le véhicule, modèle, marque, série, détails VIN",
        "it": "Informazioni veicolo, modello, marca, serie, dettagli VIN",
        "es": "Información del vehículo, modelo, marca, serie, detalles VIN",
        "pl": "Informacje o pojeździe, model, marka, seria, szczegóły VIN",
        "zh-cn": "车辆信息、型号、品牌、系列、VIN详细信息"
      },
      "default": true,
      "newLine": true,
      "xs": 4,
      "sm": 4,
      "md": 4,
      "lg": 4,
      "xl": 4
    },
    "fetchChargingHistory": {
      "type": "checkbox",
      "label": {
        "en": "Fetch Charging History",
        "de": "Ladehistorie abrufen",
        "ru": "Получать историю зарядки",
        "pt": "Buscar histórico de carregamento",
        "nl": "Laadgeschiedenis ophalen",
        "fr": "Récupérer l'historique de charge",
        "it": "Recupera cronologia ricarica",
        "es": "Obtener historial de carga",
        "pl": "Pobierz historię ładowania",
        "zh-cn": "获取充电历史"
      },
      "help": {
        "en": "Charging sessions and history data",
        "de": "Ladesitzungen und Verlaufsdaten",
        "ru": "Сессии зарядки и исторические данные",
        "pt": "Sessões de carregamento e dados históricos",
        "nl": "Laadsessies en historische gegevens",
        "fr": "Sessions de charge et données historiques",
        "it": "Sessioni di ricarica e dati storici",
        "es": "Sesiones de carga y datos históricos",
        "pl": "Sesje ładowania i dane historyczne",
        "zh-cn": "充电会话和历史数据"
      },
      "default": true,
      "newLine": false,
      "xs": 4,
      "sm": 4,
      "md": 4,
      "lg": 4,
      "xl": 4
    },
    "fetchImage": {
      "type": "checkbox",
      "label": {
        "en": "Fetch Vehicle Image",
        "de": "Fahrzeugbild abrufen",
        "ru": "Получать изображение автомобиля",
        "pt": "Buscar imagem do veículo",
        "nl": "Voertuigafbeelding ophalen",
        "fr": "Récupérer l'image du véhicule",
        "it": "Recupera immagine veicolo",
        "es": "Obtener imagen del vehículo",
        "pl": "Pobierz obraz pojazdu",
        "zh-cn": "获取车辆图像"
      },
      "help": {
        "en": "Vehicle image for display purposes",
        "de": "Fahrzeugbild für Anzeigezwecke",
        "ru": "Изображение автомобиля для отображения",
        "pt": "Imagem do veículo para fins de exibição",
        "nl": "Voertuigafbeelding voor weergavedoeleinden",
        "fr": "Image du véhicule à des fins d'affichage",
        "it": "Immagine del veicolo per scopi di visualizzazione",
        "es": "Imagen del vehículo para fines de visualización",
        "pl": "Obraz pojazdu do celów wyświetlania",
        "zh-cn": "用于显示目的的车辆图像"
      },
      "default": false,
      "newLine": false,
      "xs": 4,
      "sm": 4,
      "md": 4,
      "lg": 4,
      "xl": 4
    },

    "fetchLocationBasedChargingSettings": {
      "type": "checkbox",
      "label": {
        "en": "Fetch Location Based Charging Settings",
        "de": "Standortbasierte Ladeeinstellungen abrufen",
        "ru": "Получать настройки зарядки на основе местоположения",
        "pt": "Buscar configurações de carregamento baseadas em localização",
        "nl": "Locatiegebaseerde laadinstellingen ophalen",
        "fr": "Récupérer les paramètres de charge basés sur l'emplacement",
        "it": "Recupera impostazioni ricarica basate sulla posizione",
        "es": "Obtener configuraciones de carga basadas en ubicación",
        "pl": "Pobierz ustawienia ładowania oparte na lokalizacji",
        "zh-cn": "获取基于位置的充电设置"
      },
      "help": {
        "en": "Location-specific charging preferences and settings",
        "de": "Standortspezifische Ladepräferenzen und -einstellungen",
        "ru": "Предпочтения и настройки зарядки для конкретных местоположений",
        "pt": "Preferências e configurações de carregamento específicas do local",
        "nl": "Locatiespecifieke laadvoorkeuren en -instellingen",
        "fr": "Préférences et paramètres de charge spécifiques à l'emplacement",
        "it": "Preferenze e impostazioni di ricarica specifiche per la posizione",
        "es": "Preferencias y configuraciones de carga específicas de ubicación",
        "pl": "Preferencje i ustawienia ładowania specyficzne dla lokalizacji",
        "zh-cn": "特定位置的充电偏好和设置"
      },
      "default": false,
      "newLine": true,
      "xs": 4,
      "sm": 4,
      "md": 4,
      "lg": 4,
      "xl": 4
    },
    "fetchSmartMaintenanceTyreDiagnosis": {
      "type": "checkbox",
      "label": {
        "en": "Fetch Smart Maintenance Tyre Diagnosis",
        "de": "Smart Maintenance Reifendiagnose abrufen",
        "ru": "Получать диагностику шин Smart Maintenance",
        "pt": "Buscar diagnóstico de pneus Smart Maintenance",
        "nl": "Smart Maintenance bandendiagnose ophalen",
        "fr": "Récupérer le diagnostic des pneus Smart Maintenance",
        "it": "Recupera diagnosi pneumatici Smart Maintenance",
        "es": "Obtener diagnóstico de neumáticos Smart Maintenance",
        "pl": "Pobierz diagnozę opon Smart Maintenance",
        "zh-cn": "获取智能维护轮胎诊断"
      },
      "help": {
        "en": "Smart maintenance system tyre condition and diagnosis data",
        "de": "Smart Maintenance System Reifenzustand und Diagnosedaten",
        "ru": "Данные состояния и диагностики шин системы Smart Maintenance",
        "pt": "Dados de condição e diagnóstico de pneus do sistema Smart Maintenance",
        "nl": "Smart Maintenance systeem bandentoestand en diagnosegegevens",
        "fr": "Données de condition et de diagnostic des pneus du système Smart Maintenance",
        "it": "Dati di condizione e diagnosi pneumatici del sistema Smart Maintenance",
        "es": "Datos de condición y diagnóstico de neumáticos del sistema Smart Maintenance",
        "pl": "Dane stanu i diagnozy opon systemu Smart Maintenance",
        "zh-cn": "智能维护系统轮胎状况和诊断数据"
      },
      "default": false,
      "newLine": false,
      "xs": 4,
      "sm": 4,
      "md": 4,
      "lg": 4,
      "xl": 4
    },
    "fetchTelematicData": {
      "type": "checkbox",
      "label": {
        "en": "Fetch Telematic Data",
        "de": "Telematikdaten abrufen",
        "ru": "Получать телематические данные",
        "pt": "Buscar dados telemáticos",
        "nl": "Telematicagegevens ophalen",
        "fr": "Récupérer les données télématiques",
        "it": "Recupera dati telematici",
        "es": "Obtener datos telemáticos",
        "pl": "Pobierz dane telematyczne",
        "zh-cn": "获取远程信息处理数据"
      },
      "help": {
        "en": "Vehicle telematic data including trip information and driving behavior",
        "de": "Fahrzeugtelematikdaten einschließlich Reiseinformationen und Fahrverhalten",
        "ru": "Телематические данные автомобиля, включая информацию о поездках и поведении при вождении",
        "pt": "Dados telemáticos do veículo incluindo informações de viagem e comportamento de direção",
        "nl": "Voertuigtelematicagegevens inclusief reisinformatie en rijgedrag",
        "fr": "Données télématiques du véhicule incluant les informations de voyage et le comportement de conduite",
        "it": "Dati telematici del veicolo incluse informazioni di viaggio e comportamento di guida",
        "es": "Datos telemáticos del vehículo incluyendo información de viaje y comportamiento de conducción",
        "pl": "Dane telematyczne pojazdu obejmujące informacje o podróży i zachowanie podczas jazdy",
        "zh-cn": "车辆远程信息处理数据，包括行程信息和驾驶行为"
      },
      "default": false,
      "newLine": false,
      "xs": 4,
      "sm": 4,
      "md": 4,
      "lg": 4,
      "xl": 4
    }
  }
}
